:PROPERTIES:
:ID:       e6078fc8-4b12-44ad-b008-20f0b7311069
:END:
#+LANGUAGE: en
#+EXPORT_FILE_NAME: ./bash_command_from_alias.md

#+CALL: ../../lp.org:check-result()

For a more general introduction to creating bash commands, see [[file:bash_command.org][here]].

#+name: init
#+BEGIN_SRC bash :results none :exports none :session e6078fc8-4b12-44ad-b008-20f0b7311069
  . ./sandboxing.sh
#+END_SRC

Let's imagine you want to use clk to control your musicplayer. Chances are there
already exists some command line tool to do so and that you want to wrap it into
clk to take advantages of aliases, parameters and flows.

On that case, you most likely will want to create a simple alias on top of exec.

For the sake of this example, let's use this fake music control program and call
it 'mpc'.

#+NAME: fake_control_program
#+BEGIN_SRC bash :results none :exports code
  echo "Running mpc with: $*"
#+END_SRC

#+NAME: install_fake_music_program
#+BEGIN_SRC bash :results none :exports none :session e6078fc8-4b12-44ad-b008-20f0b7311069 :noweb yes
  cat <<"EOF" > "${TMP}/bin/mpc"
  #!/bin/bash
  <<fake_control_program>>
  EOF
  chmod +x "${TMP}/bin/mpc"
#+END_SRC

Then, to use this program as a clk command, we could simply create an alias
like this.

#+NAME: create
#+BEGIN_SRC bash :results verbatim :exports both :session e6078fc8-4b12-44ad-b008-20f0b7311069 :cache yes
  clk alias set music.play exec -- mpc play --random --use-speakers --replaygain
#+END_SRC

#+RESULTS[b647c2a71f82abeed6340d9486c5c23e9c81bf75]: create
: New global alias for music.play: exec mpc play --random --use-speakers --replaygain


Then, we can simple call this command.

#+NAME: use_play
#+BEGIN_SRC bash :results verbatim :exports both :session e6078fc8-4b12-44ad-b008-20f0b7311069 :cache yes
  clk music play MyAlbum
#+END_SRC

#+RESULTS[528d993ebba0114a75f77f47b1b7e61de533e885]: use_play
: Running mpc with: play --random --use-speakers --replaygain MyAlbum

We get the benefit of parameters, flow etc.

#+NAME: use_parameters
#+BEGIN_SRC bash :results verbatim :exports both :session e6078fc8-4b12-44ad-b008-20f0b7311069 :cache yes
clk music play --repeat --set-parameter global
clk music play MyAlbum
#+END_SRC

#+RESULTS[878efeb6fda1602dbdb5296cb1a67cfa8adb7c78]: use_parameters
: New global parameters for music.play: --repeat
: Running mpc with: play --random --use-speakers --replaygain --repeat MyAlbum

Chances are that, after some time, we realize that this command should be a
little more complicated than wrapping a single executable. For instance, we
could want to start some music server, then play some music.

We could do this with a more complicated alias.

#+NAME: more_complicated_alias
#+BEGIN_SRC bash :results verbatim :exports both :session e6078fc8-4b12-44ad-b008-20f0b7311069 :cache yes
  clk alias set music.play exec mpc start-server , exec -- mpc play --random --use-speakers --replaygain
  clk music play MyAlbum
#+END_SRC

#+RESULTS[f006cf9ec91386ec657cccf56629f0a2b23f94a7]: more_complicated_alias
: Removing global alias of music.play: exec mpc play --random --use-speakers --replaygain
: New global alias for music.play: exec mpc start-server , exec mpc play --random --use-speakers --replaygain
: Running mpc with: start-server
: Running mpc with: play --random --use-speakers --replaygain --repeat MyAlbum

As aliases grow, you may need to take a look at what it does to avoid getting
lost.

You can call the alias command to do so.

#+NAME: show-alias
#+BEGIN_SRC bash :results verbatim :exports both :session e6078fc8-4b12-44ad-b008-20f0b7311069 :cache yes
clk alias show music.play
#+END_SRC

#+RESULTS[ec752b2d64d3875b3cd1344259fc4b3c49233e01]: show-alias
: music.play exec mpc start-server, exec mpc play --random --use-speakers --replaygain

Note that showing the help of the command also gives that information.

#+NAME: help-alias
#+BEGIN_SRC bash :results verbatim :exports both :session e6078fc8-4b12-44ad-b008-20f0b7311069 :cache yes
clk music play --help|head -10
#+END_SRC

#+RESULTS[da13213a5b95d29790482b257f938028808294d4]: help-alias
#+begin_example
Usage: clk music play [OPTIONS] [COMMAND]...

  Alias for: exec mpc start-server , exec mpc play --random --use-speakers --replaygain

  The current parameters set for this command are: --repeat

  Edit this command by running `clk alias edit music.play`

Arguments:
  COMMAND  The command to execute
#+end_example


Even doing so, you may at some point want more control about what you are doing,
like waiting for the music server to be ready, you will have to fall back in a
real command. Replacing this alias with a shell command is straightforward:

#+NAME: bootstrap
#+BEGIN_SRC bash :results verbatim :exports both :session e6078fc8-4b12-44ad-b008-20f0b7311069 :cache yes
clk command create bash --replace-alias music.play
#+END_SRC

#+RESULTS[5faaca627fd5783bd0facfee4ad8845a696ab9c9]: bootstrap
: Erasing music.play alias from global settings

This command tries hard to have the same behavior as its original alias.

#+NAME: try_command
#+BEGIN_SRC bash :results verbatim :exports both :session e6078fc8-4b12-44ad-b008-20f0b7311069 :cache yes
clk music play MyAlbum
#+END_SRC

#+RESULTS[528d993ebba0114a75f77f47b1b7e61de533e885]: try_command
: Running mpc with: start-server
: Running mpc with: play --random --use-speakers --replaygain --repeat MyAlbum

Now, we can change its content to do whatever complicated flow we like.

You can simply run ~clk command edit music.play~ and it will be open in the
editor mentioned in the ~EDITOR~ environment variable.

If instead, you want to get the path of the command to open it yourself, you can simply ask for it.

#+NAME: which
#+BEGIN_SRC bash :results verbatim :exports both :session e6078fc8-4b12-44ad-b008-20f0b7311069 :cache yes
clk command which music.play|sed "s|$(pwd)|.|"
#+END_SRC

#+RESULTS[31deb56c47cb15509bc85e871dbd05209035902a]: which
: ./clk-root/bin/music.play

Note that it is also shown in the help of the command.

#+NAME: help
#+BEGIN_SRC bash :results verbatim :exports both :session e6078fc8-4b12-44ad-b008-20f0b7311069 :cache yes
clk music play --help|sed "s|$(pwd)|.|"|head -10
#+END_SRC

#+RESULTS[0ae97cb9941ed81229e5157191e0c7ddf020e5b4]: help
#+begin_example
Usage: clk music play [OPTIONS] [ARGS]...

  Description Converted from the alias music.play

  The current parameters set for this command are: --repeat

  Edit this command by running `clk command edit music.play`
  Or edit ./clk-root/bin/music.play directly.

Arguments:
#+end_example


#+BEGIN_SRC bash :exports none :tangle ../../tests/use_cases/bash_command_from_alias.sh :noweb yes :shebang "#!/bin/bash -eu"
  <<init>>
  <<install_fake_music_program>>
  check-result(create)
  check-result(use_play)
  check-result(use_parameters)
  check-result(more_complicated_alias)
  check-result(show-alias)
  check-result(help-alias)
  check-result(bootstrap)
  check-result(try_command)
  check-result(which)
  check-result(help)
#+END_SRC
